docs/instagramin_hikayesi.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Instagram'in Hikayesi</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css"/>
</head>
<body>
<div id="preamble" class="status">
<p><small>Son Güncelleme: 2023-07-11 Tue 14:52</small></p>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Instagram'in Hikayesi</h1>
</header><p>
<a href="https://tr.linkedin.com/in/suat-karakusoglu">Suat Karakuşoğlu</a> yazdı.
</p>

<p>
Sosyal hayatımızın en önemli aktörlerinden birisi olan Instagram'ın geçmişine dair <a href="https://medium.com/@katiemay36/transforming-burbn-to-instagram-b66245881d02">Burbn'in Instagram'a dönüşümü</a> yazısına okudum.
</p>

<p>
Yazıyı okumanızı tavsiye ederim.
Bu yazıda rastladığım bir konu <code>feature bloat</code> karmaşasına karşı yaklaşım.
</p>

<p>
Instagram'ın Foursquare gibi bir çok yeteneğin yanına harici yetenekleri de yapmaya çalıştığı zamanlardan yalnızca <code>fotoğraf yayınlama</code> + <code>filtre uygulama</code> + <code>like</code> edebilme yeteneklerine odaklanması sayesinde ürün tanımı daha oturaklı bir çerçeveye çekilmiş ve bu Instagram'ın hızlı yükselişinde önemli rol oynamış.
</p>

<p>
Bana Zawinski'nin aşırı özellikle şişen uygulamalar hakkındaki alaycı ifadesini hatırlattı:
</p>

<div id="outline-container-orgbd6614c" class="outline-2">
<h2 id="orgbd6614c">Zawinski's Law</h2>
<div class="outline-text-2" id="text-orgbd6614c">
<blockquote>
<p>
"Every program attempts to expand until it can read mail. Those programs which cannot so expand are replaced by ones which can."
</p>

<p>
"Her program email okuyucusu olana kadar gelişir, gelişmeyenler ise gelişenler ile değiştirilir."
&#x2014; <a href="https://www.jwz.org/about.html">Jamie Zawinski</a>
</p>
</blockquote>

<p>
Jamie <a href="http://www.catb.org/jargon/html/Z/Zawinskis-Law.html">Zawinski's Law</a> bu kurala "Law of Software Envelopment" diyor.
Bu tuzağa çok yakalanmadan ürünlerin karakteristiğinin ve sınırlarının çizilmesi gerekiyor.
Burada işin içine elbette sunulan özelliklerin düzgün bir kullanıcı deneyim tasarımı ile kullanıcının karşısına çıkması gibi derin konulara doğru ilerliyor.
</p>
</div>
</div>

<div id="outline-container-orge6fd272" class="outline-2">
<h2 id="orge6fd272">Kaynaklar</h2>
<div class="outline-text-2" id="text-orge6fd272">
<ul class="org-ul">
<li><a href="https://medium.com/@katiemay36/transforming-burbn-to-instagram-b66245881d02">Burbn'in Instagram'a dönüşümü</a></li>
<li><a href="http://www.catb.org/jargon/html/Z/Zawinskis-Law.html">Zawinski's law</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>
<footer>
  <div class="copyright-container">
    <div class="copyright">
      &copy; 1071-20∞ Mobilen bazı hakları saklıdır.<br/>
    </div>
    </br>
  </div>
</footer>
</div>
</body>
</html>
